Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.ImportDrawingItems Method
 Imports drawing setting items (*.tsds) from specified folder to model folder. Import throws exception if model is not open. Import overrides the existing drawing items in the catalog without any warnings.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ImportDrawingItems(
	string path
)
Public Function ImportDrawingItems (
	path As String
) As Boolean
Parameters
path
Type: System.String
The path to be used for import.
Return Value
Type: Boolean
true if successful.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           if (new CatalogHandler().ImportDrawingItems(System.IO.Path.GetTempPath()))
               Console.WriteLine("Drawing settings imported successfully to model.");
       }
}
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace